In [91]:
import pandas as pd

In [92]:
data = {
    "a":[1,2,3,4],
    "b":[4,5,6,7],
    "c":["Shreyash" , "Ansh", "Pandey", "Kane"]
}

In [93]:
df = pd.DataFrame(data)

In [94]:
df

   a  b         c
0  1  4  Shreyash
1  2  5      Ansh
2  3  6    Pandey
3  4  7      Kane

In [95]:
df.set_index("a", inplace=True)

In [96]:
df

   b         c
a
1  4  Shreyash
2  5      Ansh
3  6    Pandey
4  7      Kane

In [97]:
df = df.reset_index()
df

   a  b         c
0  1  4  Shreyash
1  2  5      Ansh
2  3  6    Pandey
3  4  7      Kane

In [98]:
data = {
    "a":[1,2,3,4],
    "b":[4,5,6,7],
    "c":["Shreyash" , "Ansh", "Pandey", "Kane"]
}

In [99]:
df1 = pd.DataFrame(data, index=["a1", "b1", "c1", "d1"])

In [100]:
df1

    a  b         c
a1  1  4  Shreyash
b1  2  5      Ansh
c1  3  6    Pandey
d1  4  7      Kane

In [101]:
# Re-indexing

In [102]:
df1.reindex(["b1", "c1", "d1", "a1"])

    a  b         c
b1  2  5      Ansh
c1  3  6    Pandey
d1  4  7      Kane
a1  1  4  Shreyash

In [103]:
df1

    a  b         c
a1  1  4  Shreyash
b1  2  5      Ansh
c1  3  6    Pandey
d1  4  7      Kane

In [104]:
df1.iterrows()

In [105]:
# itterrows returns a tuple which Consist of an index and its value
for i in df1.iterrows():
    print(i)

('a1', a           1
b           4
c    Shreyash
Name: a1, dtype: object)
('b1', a       2
b       5
c    Ansh
Name: b1, dtype: object)
('c1', a         3
b         6
c    Pandey
Name: c1, dtype: object)
('d1', a       4
b       7
c    Kane
Name: d1, dtype: object)

In [106]:
for i,j in df1.iterrows():
    print(i,j)

a1 a           1
b           4
c    Shreyash
Name: a1, dtype: object
b1 a       2
b       5
c    Ansh
Name: b1, dtype: object
c1 a         3
b         6
c    Pandey
Name: c1, dtype: object
d1 a       4
b       7
c    Kane
Name: d1, dtype: object

In [107]:
# Basically it iterate column
for i in df1.iteritems():
    print(i)

('a', a1    1
b1    2
c1    3
d1    4
Name: a, dtype: int64)
('b', a1    4
b1    5
c1    6
d1    7
Name: b, dtype: int64)
('c', a1    Shreyash
b1        Ansh
c1      Pandey
d1        Kane
Name: c, dtype: object)

In [108]:
for col_name, col in df1.iteritems():
    print(col_name, col)

a a1    1
b1    2
c1    3
d1    4
Name: a, dtype: int64
b a1    4
b1    5
c1    6
d1    7
Name: b, dtype: int64
c a1    Shreyash
b1        Ansh
c1      Pandey
d1        Kane
Name: c, dtype: object

In [109]:
df1

    a  b         c
a1  1  4  Shreyash
b1  2  5      Ansh
c1  3  6    Pandey
d1  4  7      Kane

In [110]:
df["a"]

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [111]:
list(df["a"])

[1, 2, 3, 4]

In [112]:
[i for i in df["a"]]

[1, 2, 3, 4]

In [113]:
df1

    a  b         c
a1  1  4  Shreyash
b1  2  5      Ansh
c1  3  6    Pandey
d1  4  7      Kane

In [114]:
def add_data(x):
    print(x)
    return x.sum()
    
df1.apply(add_data, axis=0)

a1    1
b1    2
c1    3
d1    4
Name: a, dtype: int64
a1    4
b1    5
c1    6
d1    7
Name: b, dtype: int64
a1    Shreyash
b1        Ansh
c1      Pandey
d1        Kane
Name: c, dtype: object

a                        10
b                        22
c    ShreyashAnshPandeyKane
dtype: object

In [115]:
# apply row by row ya column by column kar sakte ho
# applymap har ek data k liye specifically hota hai

In [116]:
df2 = df1[["a", "b"]]

In [117]:
df2

    a  b
a1  1  4
b1  2  5
c1  3  6
d1  4  7

In [118]:
df2.applymap(lambda x: x**2)

     a   b
a1   1  16
b1   4  25
c1   9  36
d1  16  49

In [119]:
df1.sort_values("c")

    a  b         c
b1  2  5      Ansh
d1  4  7      Kane
c1  3  6    Pandey
a1  1  4  Shreyash

In [120]:
df.sort_index(ascending=False)

   a  b         c
3  4  7      Kane
2  3  6    Pandey
1  2  5      Ansh
0  1  4  Shreyash

In [121]:
pd.set_option("display.max_colwidth" ,1000)
df3 = pd.DataFrame({"Desc" :["Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.", "Hello", "There"] })

In [122]:
df3

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            Desc
0  Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.
1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          Hello
2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          There

In [123]:
# 'Series' object has no attribute 'applymap'
df3["Bhai"] = df3.applymap(len)
df3

,Desc,Bhai
0,"Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.",765
1,Hello,5
2,There,5

In [124]:

df3["len"] = df3['Desc'].apply(len)
df3

,Desc,Bhai,len
0,"Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.",765,765
1,Hello,5,5
2,There,5,5

In [127]:
def word_count(x):
    print(x)
    return len(x.split())

df3["word_count"] = df3["Desc"].apply(word_count)

Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.
Hello
There

In [128]:
df3

,Desc,Bhai,len,work_count,word_count
0,"Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.",765,765,104,104
1,Hello,5,5,1,1
2,There,5,5,1,1